tests/performance/results/final-reports/local-20260423/product-list-read.log
Prometheus remote write: http://localhost:9090/api/v1/write
k6 testid: 20260423-final-report-product-list-read
Trend stats: p(90),p(95),avg,min,max

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: tests/performance/k6/product-list-read.js
        output: Prometheus remote write (http://localhost:9090/api/v1/write)

     scenarios: (100.00%) 1 scenario, 25 max VUs, 1m15s max duration (incl. graceful stop):
              * product_read: 25 looping VUs for 45s (gracefulStop: 30s)


running (0m01.0s), 25/25 VUs, 25 complete and 0 interrupted iterations
product_read   [   2% ] 25 VUs  01.0s/45s

running (0m02.0s), 25/25 VUs, 75 complete and 0 interrupted iterations
product_read   [   4% ] 25 VUs  02.0s/45s

running (0m03.0s), 25/25 VUs, 125 complete and 0 interrupted iterations
product_read   [   7% ] 25 VUs  03.0s/45s

running (0m04.0s), 25/25 VUs, 175 complete and 0 interrupted iterations
product_read   [   9% ] 25 VUs  04.0s/45s

running (0m05.0s), 25/25 VUs, 225 complete and 0 interrupted iterations
product_read   [  11% ] 25 VUs  05.0s/45s

running (0m06.0s), 25/25 VUs, 275 complete and 0 interrupted iterations
product_read   [  13% ] 25 VUs  06.0s/45s

running (0m07.0s), 25/25 VUs, 325 complete and 0 interrupted iterations
product_read   [  16% ] 25 VUs  07.0s/45s

running (0m08.0s), 25/25 VUs, 375 complete and 0 interrupted iterations
product_read   [  18% ] 25 VUs  08.0s/45s

running (0m09.0s), 25/25 VUs, 425 complete and 0 interrupted iterations
product_read   [  20% ] 25 VUs  09.0s/45s

running (0m10.0s), 25/25 VUs, 475 complete and 0 interrupted iterations
product_read   [  22% ] 25 VUs  10.0s/45s

running (0m11.0s), 25/25 VUs, 525 complete and 0 interrupted iterations
product_read   [  24% ] 25 VUs  11.0s/45s

running (0m12.0s), 25/25 VUs, 575 complete and 0 interrupted iterations
product_read   [  27% ] 25 VUs  12.0s/45s

running (0m13.0s), 25/25 VUs, 625 complete and 0 interrupted iterations
product_read   [  29% ] 25 VUs  13.0s/45s

running (0m14.0s), 25/25 VUs, 675 complete and 0 interrupted iterations
product_read   [  31% ] 25 VUs  14.0s/45s

running (0m15.0s), 25/25 VUs, 725 complete and 0 interrupted iterations
product_read   [  33% ] 25 VUs  15.0s/45s

running (0m16.0s), 25/25 VUs, 775 complete and 0 interrupted iterations
product_read   [  36% ] 25 VUs  16.0s/45s

running (0m17.0s), 25/25 VUs, 825 complete and 0 interrupted iterations
product_read   [  38% ] 25 VUs  17.0s/45s

running (0m18.0s), 25/25 VUs, 875 complete and 0 interrupted iterations
product_read   [  40% ] 25 VUs  18.0s/45s

running (0m19.0s), 25/25 VUs, 925 complete and 0 interrupted iterations
product_read   [  42% ] 25 VUs  19.0s/45s

running (0m20.0s), 25/25 VUs, 975 complete and 0 interrupted iterations
product_read   [  44% ] 25 VUs  20.0s/45s

running (0m21.0s), 25/25 VUs, 1025 complete and 0 interrupted iterations
product_read   [  47% ] 25 VUs  21.0s/45s

running (0m22.0s), 25/25 VUs, 1075 complete and 0 interrupted iterations
product_read   [  49% ] 25 VUs  22.0s/45s

running (0m24.9s), 25/25 VUs, 1125 complete and 0 interrupted iterations
product_read   [  51% ] 25 VUs  23.0s/45s

running (0m25.9s), 25/25 VUs, 1175 complete and 0 interrupted iterations
product_read   [  53% ] 25 VUs  24.0s/45s

running (0m26.9s), 25/25 VUs, 1225 complete and 0 interrupted iterations
product_read   [  56% ] 25 VUs  25.0s/45s

running (0m27.9s), 25/25 VUs, 1275 complete and 0 interrupted iterations
product_read   [  58% ] 25 VUs  26.0s/45s

running (0m28.9s), 25/25 VUs, 1325 complete and 0 interrupted iterations
product_read   [  60% ] 25 VUs  27.0s/45s

running (0m29.9s), 25/25 VUs, 1375 complete and 0 interrupted iterations
product_read   [  62% ] 25 VUs  28.0s/45s

running (0m30.9s), 25/25 VUs, 1425 complete and 0 interrupted iterations
product_read   [  64% ] 25 VUs  29.0s/45s

running (0m31.9s), 25/25 VUs, 1475 complete and 0 interrupted iterations
product_read   [  67% ] 25 VUs  30.0s/45s

running (0m32.9s), 25/25 VUs, 1525 complete and 0 interrupted iterations
product_read   [  69% ] 25 VUs  31.0s/45s

running (0m33.9s), 25/25 VUs, 1575 complete and 0 interrupted iterations
product_read   [  71% ] 25 VUs  32.0s/45s

running (0m34.9s), 25/25 VUs, 1625 complete and 0 interrupted iterations
product_read   [  73% ] 25 VUs  33.0s/45s

running (0m35.9s), 25/25 VUs, 1675 complete and 0 interrupted iterations
product_read   [  76% ] 25 VUs  34.0s/45s

running (0m36.9s), 25/25 VUs, 1725 complete and 0 interrupted iterations
product_read   [  78% ] 25 VUs  35.0s/45s

running (0m37.9s), 25/25 VUs, 1775 complete and 0 interrupted iterations
product_read   [  80% ] 25 VUs  36.0s/45s

running (0m38.9s), 25/25 VUs, 1825 complete and 0 interrupted iterations
product_read   [  82% ] 25 VUs  37.0s/45s

running (0m39.9s), 25/25 VUs, 1875 complete and 0 interrupted iterations
product_read   [  84% ] 25 VUs  38.0s/45s

running (0m40.9s), 25/25 VUs, 1925 complete and 0 interrupted iterations
product_read   [  87% ] 25 VUs  39.0s/45s

running (0m41.9s), 25/25 VUs, 1975 complete and 0 interrupted iterations
product_read   [  89% ] 25 VUs  40.0s/45s

running (0m42.9s), 25/25 VUs, 2025 complete and 0 interrupted iterations
product_read   [  91% ] 25 VUs  41.0s/45s

running (0m43.9s), 25/25 VUs, 2075 complete and 0 interrupted iterations
product_read   [  93% ] 25 VUs  42.0s/45s

running (0m44.9s), 25/25 VUs, 2125 complete and 0 interrupted iterations
product_read   [  96% ] 25 VUs  43.0s/45s

running (0m45.9s), 25/25 VUs, 2175 complete and 0 interrupted iterations
product_read   [  98% ] 25 VUs  44.0s/45s

running (0m46.9s), 25/25 VUs, 2225 complete and 0 interrupted iterations
product_read   [ 100% ] 25 VUs  45.0s/45s


  █ THRESHOLDS 

    checks
    ✓ 'rate==1' rate=100.00%

    http_req_duration
    ✓ 'p(95)<1000' p(95)=5.9ms

    http_req_failed
    ✓ 'rate==0' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 4500    95.256918/s
    checks_succeeded...: 100.00% 4500 out of 4500
    checks_failed......: 0.00%   0 out of 4500

    ✓ list status is 200
    ✓ product list returned array

    HTTP
    http_req_duration..............: avg=3.04ms   min=699.14µs med=2.22ms   max=65.28ms  p(90)=4.3ms    p(95)=5.9ms   
      { expected_response:true }...: avg=3.04ms   min=699.14µs med=2.22ms   max=65.28ms  p(90)=4.3ms    p(95)=5.9ms   
    http_req_failed................: 0.00%  0 out of 2250
    http_reqs......................: 2250   47.628459/s

    EXECUTION
    iteration_duration.............: avg=503.69ms min=500.86ms med=502.87ms max=567.68ms p(90)=504.99ms p(95)=506.65ms
    iterations.....................: 2250   47.628459/s
    vus............................: 25     min=25        max=25
    vus_max........................: 25     min=25        max=25

    NETWORK
    data_received..................: 2.5 MB 54 kB/s
    data_sent......................: 239 kB 5.0 kB/s



running (0m47.2s), 00/25 VUs, 2250 complete and 0 interrupted iterations
product_read ✓ [ 100% ] 25 VUs  45s